Saumya2721/smart-trainer/ESP8266 Original Code.cpp
/* SmartTrainer - FULL Firmware (Web UI + SD logging)
 * - ESP8266 (NodeMCU / Wemos D1 Mini)
 * - Adafruit ICM-20948 + Madgwick (filter kept; angle uses accel)
 * - UI: Chart.js (loaded first), tooltips, RGB colors, pause, CSV download
 * - Browser CSV: ms,angle_deg,ax,ay,az,accel_mag_g,gx,gy,gz,gyro_mag_rads
 * - SD CSV (same columns), 10 Hz write
 * - Stability: IMU sampling ~15ms, yield() included
 */

#include <Wire.h>
#include <SPI.h>
#include <SD.h>
#include <EEPROM.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>

#include <Adafruit_ICM20948.h>
#include <MadgwickAHRS.h>

// ---------------- PIN DEFINITIONS ----------------
#define SWITCH_PIN 16  // D0: HIGH = web mode, LOW = SD mode
#define SD_CS      15  // D8
#define SDA_PIN     4  // D2
#define SCL_PIN     5  // D1

// ---------------- WIFI ----------------
const char* ssid = "123";
const char* password = "svarshil56";

// ---------------- HARDWARE OBJECTS ----------------
Adafruit_ICM20948 icm;
Madgwick filter;
ESP8266WebServer server(80);

// ---------------- GLOBAL STATE ----------------
// Latest sensor & computed values (kept small & volatile-ish)
volatile float latest_ax = 0.0f, latest_ay = 0.0f, latest_az = 0.0f; // m/s^2
volatile float latest_gx = 0.0f, latest_gy = 0.0f, latest_gz = 0.0f; // rad/s
volatile float latest_accel_g = 0.0f;   // g
volatile float latest_gyro_mag = 0.0f;  // rad/s
volatile float latest_qw = 1.0f, latest_qx = 0.0f, latest_qy = 0.0f, latest_qz = 0.0f;
volatile float latest_angle_deg = 0.0f; // ACCEL-based angle
volatile unsigned long latest_ms = 0;

int sessionNum = 0;

// ---------------- TIMINGS ----------------
const unsigned long IMU_INTERVAL_MS = 15; // ~66 Hz sampler
const unsigned long LOG_INTERVAL_MS = 100; // 10 Hz SD write
const unsigned long WEB_FETCH_MS = 150;    // UI fetch period

// ---------------- HTML/JS UI (PROGMEM) ----------------
const char webpage[] PROGMEM = R"rawliteral(
<!doctype html>
<html>
<head>
<meta name="viewport" content="width=device-width,initial-scale=1">
<meta charset="utf-8">
<title>SmartTrainer — Biceps Curl Tracker</title>

<!-- Load Chart.js first (from CDN) -->
<script src="https://cdn.jsdelivr.net/npm/chart.js"></script>

<style>
  body{margin:0;padding:12px;font-family:Arial,Helvetica,sans-serif;background:#0b0f12;color:#e6eef6}
  .top{display:flex;justify-content:space-between;align-items:center;max-width:960px;margin:0 auto 8px auto}
  h1{font-size:18px;margin:0}
  .status{color:#6ee7b7}
  #values{max-width:960px;margin:8px auto;color:#dbe7f0}
  .controls{max-width:960px;margin:6px auto}
  .btn{background:#111827;color:#fff;border:0;padding:8px 12px;border-radius:6px;margin-right:8px;cursor:pointer}
  .btn.primary{background:rgb(88,166,255);color:#021426}
  .graph-title{max-width:960px;margin:10px auto 0 auto;text-align:left;color:#9aa6b2}
  canvas{display:block;background:#0f1720;border-radius:8px;max-width:960px;margin:8px auto;padding:8px}
  .note{max-width:960px;margin:12px auto;color:#9aa6b2;font-size:13px}
  @media (max-width:560px){canvas{width:95%}}
</style>
</head>
<body>
  <div class="top">
    <div><h1>SmartTrainer — Biceps Curl Tracker</h1><div class="small">Simple live view</div></div>
    <div class="status" id="status">Connecting...</div>
  </div>

  <div id="values">Angle=--° | Accel=-- g | Gyro=--</div>

  <div class="controls">
    <button id="pause" class="btn">Pause</button>
    <button id="download" class="btn primary">Download CSV</button>
  </div>

  <div class="graph-title">Angle (°)</div>
  <canvas id="angleChart" width="900" height="160"></canvas>

  <div class="graph-title">Acceleration Magnitude (g)</div>
  <canvas id="accelChart" width="900" height="160"></canvas>

  <div class="graph-title">Gyro Magnitude (rad/s)</div>
  <canvas id="gyroChart" width="900" height="160"></canvas>

  <div class="note">Graphs show ~60 samples (updates every 150 ms). Tap a line to see exact value (tooltips enabled).</div>

<script>
/* UI code is safe-run inside onload to avoid race conditions */
window.onload = function(){
  const FETCH_MS = 150;
  let paused = false;
  const buffer = []; const BUF_MAX = 900; // keep recent samples

  const statusEl = document.getElementById('status');
  const valuesEl = document.getElementById('values');
  const pauseBtn = document.getElementById('pause');
  const downloadBtn = document.getElementById('download');

  pauseBtn.onclick = () => { paused = !paused; pauseBtn.textContent = paused ? 'Resume' : 'Pause'; };

  function pushSample(s){
    buffer.push(s);
    if(buffer.length > BUF_MAX) buffer.shift();
  }

  downloadBtn.onclick = () => {
    if(buffer.length === 0){ alert('No samples in buffer'); return; }
    const header = 'ms,angle_deg,ax_mps2,ay_mps2,az_mps2,accel_mag_g,gx_rads,gy_rads,gz_rads,gyro_mag_rads\n';
    const rows = buffer.map(s => `${s.ms},${s.angle.toFixed(6)},${s.ax.toFixed(6)},${s.ay.toFixed(6)},${s.az.toFixed(6)},${s.accel.toFixed(6)},${s.gx.toFixed(6)},${s.gy.toFixed(6)},${s.gz.toFixed(6)},${s.gyro.toFixed(6)}`).join('\n');
    const blob = new Blob([header + rows], {type:'text/csv'});
    const url = URL.createObjectURL(blob);
    const a = document.createElement('a'); a.href = url; a.download = 'smarttrainer_buffer.csv'; document.body.appendChild(a); a.click(); a.remove(); URL.revokeObjectURL(url);
  };

  // Chart helper
  function makeChart(canvasId, label, color) {
    const ctx = document.getElementById(canvasId).getContext('2d');
    return new Chart(ctx, {
      type: 'line',
      data: { labels: [], datasets: [{ label: label, data: [], borderColor: color, borderWidth: 2, pointRadius: 0, fill: false }] },
      options: {
        animation: false,
        interaction: { mode: 'index', intersect: false },
        plugins: {
          tooltip: { enabled: true, displayColors: false },
          legend: { display: false }
        },
        scales: { x: { display: false }, y: { ticks: { color: '#cfe9ff' } } }
      }
    });
  }

  const angleChart = makeChart('angleChart', 'Angle (°)', 'rgb(255,204,0)');
  const accelChart = makeChart('accelChart', 'Accel (g)', 'rgb(0,200,255)');
  const gyroChart  = makeChart('gyroChart', 'Gyro (rad/s)', 'rgb(255,120,0)');

  // fetch function with cache-busting
  async function fetchData(){
    if(paused) return;
    try{
      const res = await fetch('/data?ts=' + Date.now(), {cache:'no-store'});
      if(!res.ok){ statusEl.textContent = 'Fetch error'; return; }
      const j = await res.json();
      // Expect ms, angle, accel{x,y,z,mag}, gyro{x,y,z,mag}
      statusEl.textContent = 'OK ' + new Date().toLocaleTimeString();
      valuesEl.textContent = `Angle=${j.angle.toFixed(1)}° | Accel=${j.accel.mag.toFixed(2)}g | Gyro=${j.gyro.mag.toFixed(3)}`;
      // charts
      angleChart.data.labels.push(''); angleChart.data.datasets[0].data.push(j.angle);
      accelChart.data.labels.push(''); accelChart.data.datasets[0].data.push(j.accel.mag);
      gyroChart.data.labels.push(''); gyroChart.data.datasets[0].data.push(j.gyro.mag);
      [angleChart,accelChart,gyroChart].forEach(ch=>{
        if(ch.data.labels.length > 60){ ch.data.labels.shift(); ch.data.datasets[0].data.shift(); }
        ch.update();
      });
      // push buffer full vector
      pushSample({
        ms: j.ms || Date.now(),
        angle: j.angle,
        ax: j.accel.x, ay: j.accel.y, az: j.accel.z, accel: j.accel.mag,
        gx: j.gyro.x, gy: j.gyro.y, gz: j.gyro.z, gyro: j.gyro.mag
      });
    } catch(e){
      console.error('fetchData error', e);
      statusEl.textContent = 'JS error';
    }
  }

  // initial small delay then start
  setTimeout(()=>{ fetchData(); setInterval(fetchData, FETCH_MS); }, 100);
};
</script>
</body>
</html>
)rawliteral";

// ---------------- HELPERS ----------------
float accelAngleDeg(float ax, float ay, float az){
  float mag = sqrt(ax*ax + ay*ay + az*az);
  if(mag < 1e-6f) return 0.0f;
  float v = az / mag;
  if(v > 1.0f) v = 1.0f;
  if(v < -1.0f) v = -1.0f;
  return acos(v) * 180.0f / PI;
}

// ---------------- IMU SAMPLER ----------------
unsigned long imu_last_ms = 0;
void imuSampleOnce(){
  unsigned long now = millis();
  if(now - imu_last_ms < IMU_INTERVAL_MS) return;
  imu_last_ms = now;

  yield(); // keep watchdog happy

  sensors_event_t a,g,m,t;
  // icm.getEvent returns void on some libs, but Adafruit returns events into provided structs.
  // If it fails to fill, we still continue with zeros.
  icm.getEvent(&a, &g, &m, &t);

  // update filter (kept but angle uses accel)
  filter.updateIMU(g.gyro.x, g.gyro.y, g.gyro.z,
                   a.acceleration.x, a.acceleration.y, a.acceleration.z);

  // raw values
  latest_ax = a.acceleration.x;
  latest_ay = a.acceleration.y;
  latest_az = a.acceleration.z;

  latest_gx = g.gyro.x;
  latest_gy = g.gyro.y;
  latest_gz = g.gyro.z;

  // magnitudes
  float accel_g = sqrt(latest_ax*latest_ax + latest_ay*latest_ay + latest_az*latest_az) / 9.80665f;
  float gyro_mag = sqrt(latest_gx*latest_gx + latest_gy*latest_gy + latest_gz*latest_gz);

  latest_accel_g = accel_g;
  latest_gyro_mag = gyro_mag;

  latest_qw = filter.q0; latest_qx = filter.q1; latest_qy = filter.q2; latest_qz = filter.q3;

  // compute accel-based tilt angle
  latest_angle_deg = accelAngleDeg(latest_ax, latest_ay, latest_az);
  latest_ms = now;
}

// ---------------- HTTP HANDLERS ----------------
void handleRoot(){
  server.send_P(200, "text/html", webpage);
}

void handleData(){
  // snapshot copy
  float ax = latest_ax; float ay = latest_ay; float az = latest_az;
  float gx = latest_gx; float gy = latest_gy; float gz = latest_gz;
  float accel_g = latest_accel_g;
  float gyro_mag = latest_gyro_mag;
  float ang = latest_angle_deg;
  unsigned long ms = latest_ms;

  char buf[512];
  int n = snprintf(buf, sizeof(buf),
    "{\"ms\":%lu,\"angle\":%.6f,"
    "\"accel\":{\"x\":%.6f,\"y\":%.6f,\"z\":%.6f,\"mag\":%.6f},"
    "\"gyro\":{\"x\":%.6f,\"y\":%.6f,\"z\":%.6f,\"mag\":%.6f}}",
    ms, ang,
    ax, ay, az, accel_g,
    gx, gy, gz, gyro_mag);
  if(n > 0) server.send(200, "application/json", buf);
  else server.send(500, "text/plain", "JSON error");
}

// ---------------- WEB MODE ----------------
void runWebServerMode(){
  Serial.println(F(">> WEB MODE"));
  WiFi.begin(ssid, password);
  Serial.print(F("Connecting WiFi"));
  unsigned long start = millis();
  while(WiFi.status() != WL_CONNECTED){
    delay(200);
    Serial.print('.');
    imuSampleOnce();
    yield();
    if(millis() - start > 15000) break;
  }
  Serial.println();
  Serial.print(F("IP: ")); Serial.println(WiFi.localIP());

  server.on("/", handleRoot);
  server.on("/data", handleData);
  server.begin();

  while(digitalRead(SWITCH_PIN) == HIGH){
    imuSampleOnce();
    server.handleClient();
    yield();
    delay(1);
  }

  Serial.println(F("Switch flipped — restarting"));
  ESP.restart();
}

// ---------------- SD MODE ----------------
void runSDMode(){
  Serial.println(F(">> SD MODE"));
  if(!SD.begin(SD_CS)){
    Serial.println(F("SD init failed. Check D8 pin."));
    while(1) delay(1000);
  }
  Serial.println(F("SD OK"));

  // attempt NTP for folder name
  String folder = "";
  bool haveTime = false;
  WiFi.begin(ssid, password);
  int tries = 0;
  while(WiFi.status() != WL_CONNECTED && tries < 20){
    delay(250);
    imuSampleOnce();
    yield();
    Serial.print('.');
    tries++;
  }
  Serial.println();

  if(WiFi.status() == WL_CONNECTED){
    configTime(19800, 0, "pool.ntp.org", "time.nist.gov");
    time_t now = time(nullptr);
    int ttries = 0;
    while(now < 1000 && ttries < 15){
      delay(200);
      imuSampleOnce();
      yield();
      now = time(nullptr);
      ttries++;
    }
    if(now > 1000){
      struct tm timeinfo; localtime_r(&now, &timeinfo);
      char buf[40]; strftime(buf, sizeof(buf), "/%Y-%m-%d_%H-%M-%S", &timeinfo);
      folder = String(buf);
      haveTime = true;
    }
    WiFi.disconnect(true);
  }

  if(!haveTime){
    EEPROM.begin(16);
    int s = EEPROM.read(0);
    s = s + 1;
    if(s < 1 || s > 250) s = 1;
    EEPROM.write(0, s);
    EEPROM.commit();
    sessionNum = s;
    folder = "/session_" + String(s);
  } else {
    EEPROM.begin(16);
    sessionNum = EEPROM.read(0);
  }

  if(!SD.exists(folder)) SD.mkdir(folder);
  String filename = folder + "/imu_log.csv";

  File f = SD.open(filename, FILE_WRITE);
  if(f){
    if(f.size() == 0){
      f.println("ms,angle_deg,ax_mps2,ay_mps2,az_mps2,accel_mag_g,gx_rads,gy_rads,gz_rads,gyro_mag_rads");
    }
    f.close();
  } else {
    Serial.println(F("Failed to open imu log file"));
  }

  Serial.println("Logging to: " + filename);

  unsigned long lastLogMs = 0;

  while(digitalRead(SWITCH_PIN) == LOW){
    imuSampleOnce();
    unsigned long now = millis();
    if(now - lastLogMs >= LOG_INTERVAL_MS){
      lastLogMs = now;

      float ax = latest_ax, ay = latest_ay, az = latest_az;
      float gx = latest_gx, gy = latest_gy, gz = latest_gz;
      float accel_g = latest_accel_g;
      float gyro_mag = latest_gyro_mag;
      float angle = latest_angle_deg;
      unsigned long msstamp = latest_ms;

      File df = SD.open(filename, FILE_WRITE);
      if(df){
        df.printf("%lu,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f\n",
                  msstamp,
                  angle,
                  ax, ay, az,
                  accel_g,
                  gx, gy, gz,
                  gyro_mag);
        df.close();
      } else {
        Serial.println(F("Failed to open log file"));
      }
    }
    yield();
    delay(1);
  }

  Serial.println(F("Switch flipped — restarting"));
  ESP.restart();
}

// ---------------- SETUP ----------------
void setup(){
  Serial.begin(115200);
  delay(200);

  pinMode(SWITCH_PIN, INPUT_PULLUP);
  Wire.begin(SDA_PIN, SCL_PIN);

  if(!icm.begin_I2C(0x68)){
    Serial.println(F("ICM-20948 not found! Check wiring (SDA->D2, SCL->D1)."));
    while(1) delay(10);
  }
  Serial.println(F("ICM-20948 found"));

  icm.setAccelRange(ICM20948_ACCEL_RANGE_4_G);
  icm.setGyroRange(ICM20948_GYRO_RANGE_500_DPS);

  filter.begin(100.0f);

  // Auto-calibrate step (optional) — gather quaternions
  Serial.println(F("Auto-calibrating: hold forearm straight down for 2.5s..."));
  unsigned long t0 = millis();
  unsigned long tEnd = t0 + 2500;
  float qw_acc = 0, qx_acc = 0, qy_acc = 0, qz_acc = 0;
  int cnt = 0;
  while(millis() < tEnd){
    imuSampleOnce();
    qw_acc += filter.q0; qx_acc += filter.q1; qy_acc += filter.q2; qz_acc += filter.q3;
    cnt++;
    delay(10);
    yield();
  }
  if(cnt > 0) Serial.println(F("Calibration stored."));
  else Serial.println(F("Calibration skipped (no data)"));

  // register routes
  server.on("/", handleRoot);
  server.on("/data", handleData);

  // session number from EEPROM
  EEPROM.begin(16);
  sessionNum = EEPROM.read(0);

  // choose mode
  bool webMode = (digitalRead(SWITCH_PIN) == HIGH);
  if(webMode) runWebServerMode();
  else runSDMode();
}

void loop(){
  // main loops located in runWebServerMode or runSDMode
}
